## Práctica 35

__Rehacer códigos de la clase de hoy(Clase 64-Indexación, selección y filtrado), además añada un ejemplo propio.__

- página 11 -> página 23(1ª parte clase)
- página 37(2ª parte clase. Hasta Aritmética y alineación de datos)

[Primeros_Pasos_2.pdf]

------------------

__Código necesario__

In [209]:
import pandas as pd

In [210]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
"year": [2000, 2001, 2002, 2001, 2002, 2003],
"pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [211]:
pd.DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [212]:
frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

----------

#### __¿Cuál es la diferencia entre iloc y loc?__

__1- iloc (Index Location):__

Se utiliza para seleccionar elementos basados en su ubicación (índice de posición).
- Para las filas, puedes usar números enteros para acceder a las posiciones. Por ejemplo:

    - df.iloc[0] Selecciona la primera fila
    - df.iloc[1] Selecciona la segunda fila
    - df.iloc[-1] Selecciona la última fila

- Para las columnas, también puedes usar números enteros:

    - df.iloc[:, 0] Selecciona la primera columna.
    - df.iloc[:, 1] Selecciona la segunda columna.
    - df.iloc[:, -1] Selecciona la última columna

__2- loc (Label Location):__

Se basa en etiquetas (nombres asignados a filas y columnas). Puedes usar etiquetas
personalizadas o nombres de índice para acceder a los datos.

Ejemplos:
 - df.loc[0] Selecciona la fila con etiqueta 0.
 - df.loc['Etiqueta_o_nombre_fila'] Selecciona la fila con el nombre de la fila o etiqueta.
 - df.loc[:, 'Nombre_Columna'] Selecciona una columna por su nombre.
    
Vuelta al ejemplo de la celda 42

In [213]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

-------------

__Ejemplo propio__

In [214]:
mydata = {"comm": ["Madrid", "Madrid", "Madrid", "Andalucia", "Andalucia", "Andalucia"],
"year": [2010, 2012, 2015, 2012, 2015, 2018],
"pop": [6.3, 6.5, 7.9, 6.7, 7.5, 8.9]}
myframe = pd.DataFrame(mydata)

In [215]:
myframe

        comm  year  pop
0     Madrid  2010  6.3
1     Madrid  2012  6.5
2     Madrid  2015  7.9
3  Andalucia  2012  6.7
4  Andalucia  2015  7.5
5  Andalucia  2018  8.9

In [216]:
myframe2 = pd.DataFrame(mydata, columns=["year", "comm", "pop", "debt"])
myframe2

   year       comm  pop debt
0  2010     Madrid  6.3  NaN
1  2012     Madrid  6.5  NaN
2  2015     Madrid  7.9  NaN
3  2012  Andalucia  6.7  NaN
4  2015  Andalucia  7.5  NaN
5  2018  Andalucia  8.9  NaN

Las columnas pueden modificarse por asignación. Por ejemplo, a la columna `debt` vacía se
le puede asignar un valor escalar o un array de valores:

In [217]:
frame2["debt"] = 16.5
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

--------

__Ejemplo propio__

In [218]:
myframe2["debt"] = 4.1
myframe2

   year       comm  pop  debt
0  2010     Madrid  6.3   4.1
1  2012     Madrid  6.5   4.1
2  2015     Madrid  7.9   4.1
3  2012  Andalucia  6.7   4.1
4  2015  Andalucia  7.5   4.1
5  2018  Andalucia  8.9   4.1

Cuando asigne listas o arrays a una columna, la longitud del valor debe coincidir con la
longitud del DataFrame. Si asigna una `Serie` , sus etiquetas se realinearán exactamente
con el índice del DataFrame, insertando los valores que falten en cualquier valor del índice que no esté presente:

In [219]:
val = pd.Series([-1.2, -1.5, -1.7], index=[2, 4, 5])
frame2["debt"] = val
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

-----------

__Ejemplo propio__

In [220]:
myval = pd.Series([-2.4, 3.7, -6.3], index=[2, 4, 5])
myframe2["debt"] = myval
myframe2

   year       comm  pop  debt
0  2010     Madrid  6.3   NaN
1  2012     Madrid  6.5   NaN
2  2015     Madrid  7.9  -2.4
3  2012  Andalucia  6.7   NaN
4  2015  Andalucia  7.5   3.7
5  2018  Andalucia  8.9  -6.3

Al asignar una columna que no existe se creará una columna
nueva. La palabra clave `del` borrará columnas como con un
diccionario. Como ejemplo, primero se añade una nueva
columna de valores booleanos donde la columna `state` es
igual a `"Ohio"` :

In [221]:
frame2["eastern"] = frame2["state"] == "Ohio"
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6  -1.2     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9  -1.5    False
5  2003  Nevada  3.2  -1.7    False

----

__Ejemplo propio__

In [222]:
myframe2["south"] = myframe2["comm"] == "Andalucia"
myframe2

   year       comm  pop  debt  south
0  2010     Madrid  6.3   NaN  False
1  2012     Madrid  6.5   NaN  False
2  2015     Madrid  7.9  -2.4  False
3  2012  Andalucia  6.7   NaN   True
4  2015  Andalucia  7.5   3.7   True
5  2018  Andalucia  8.9  -6.3   True

El método del se puede utilizar para eliminar esta columna:

In [223]:
del frame2["eastern"]

In [224]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [225]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [226]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

--------

__Ejemplo propio__

In [227]:
del myframe2["south"]

In [228]:
myframe2.columns

Index(['year', 'comm', 'pop', 'debt'], dtype='object')

In [229]:
myframe2

   year       comm  pop  debt
0  2010     Madrid  6.3   NaN
1  2012     Madrid  6.5   NaN
2  2015     Madrid  7.9  -2.4
3  2012  Andalucia  6.7   NaN
4  2015  Andalucia  7.5   3.7
5  2018  Andalucia  8.9  -6.3

In [230]:
myframe

        comm  year  pop
0     Madrid  2010  6.3
1     Madrid  2012  6.5
2     Madrid  2015  7.9
3  Andalucia  2012  6.7
4  Andalucia  2015  7.5
5  Andalucia  2018  8.9

#### __Cuidado.__

La columna devuelta al indexar un DataFrame es una vista de los datos subyacentes, no una copia. Por lo tanto, cualquier modificación en la Series se reflejará en el DataFrame. La columna puede copiarse explícitamente con el método copy de la Series .

Otra forma común de datos es un diccionario anidado de diccionarios:

In [231]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6}, "Nevada": {2001: 2.4, 2002: 2.9}}

----------

__Ejemplo propio__

In [232]:
mypopulations = {"Madrid": {2010: 6.5, 2012: 6.5, 2015: 7.9}, "Andalucia": {2012: 6.7, 2015: 7.5}}

Si el diccionario anidado se pasa al DataFrame, pandas interpretará las claves externas del diccionario como las columnas, y las claves internas como los índices de fila:

In [233]:
frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

-------------

__Ejemplo propio__

In [234]:
myframe3 = pd.DataFrame(mypopulations)
myframe3

      Madrid  Andalucia
2010     6.5        NaN
2012     6.5        6.7
2015     7.9        7.5

Puede transponer el DataFrame (intercambiar filas y columnas) con una sintaxis similar a la de un array NumPy:

In [235]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [236]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

-------

__Ejemplo propio__

In [237]:
myframe3.T

           2010  2012  2015
Madrid      6.5   6.5   7.9
Andalucia   NaN   6.7   7.5

In [238]:
myframe3

      Madrid  Andalucia
2010     6.5        NaN
2012     6.5        6.7
2015     7.9        7.5

#### __Cuidado__

Tenga en cuenta que la transposición descarta los tipos de datos de columna si las columnas no tienen todas el mismo tipo de datos, por lo que transponer y luego volver a transponer puede perder la información del tipo anterior. En este caso, las columnas se convierten en arrays de objetos Python puros.

Las claves de los diccionarios internos se combinan para formar el índice del resultado. Esto no es cierto si se especifica un índice explícito:

In [239]:
pd.DataFrame(populations, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

------

__Ejemplo propio__

In [240]:
pd.DataFrame(mypopulations, index=[2010, 2012, 2015])

      Madrid  Andalucia
2010     6.5        NaN
2012     6.5        6.7
2015     7.9        7.5

Los diccionarios de Series reciben un tratamiento muy similar:

In [241]:
pdata = {"Ohio": frame3["Ohio"][:-1],"Nevada": frame3["Nevada"][:2]}
# frame3["Ohio"][:-1]: Extrae todos los valores de la columna “Ohio”
# excepto el último valor.
# frame3["Nevada"][:2]:Extrae los primeros dos valores de la columna “Nevada”
# en el DataFrame frame3.
pdata

{'Ohio': 2000    1.5
 2001    1.7
 Name: Ohio, dtype: float64,
 'Nevada': 2000    NaN
 2001    2.4
 Name: Nevada, dtype: float64}

In [242]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [243]:
mypdata = {"Madrid": myframe3["Madrid"][:-1],"Andalucia": myframe3["Andalucia"][:2]}
# myframe3["Madrid"][:-1]: Extrae todos los valores de la columna “Madrid”
# excepto el último valor.
# myframe3["Andalucia"][:2]:Extrae los primeros dos valores de la columna “Andalucia”
# en el DataFrame myframe3.
mypdata

{'Madrid': 2010    6.5
 2012    6.5
 Name: Madrid, dtype: float64,
 'Andalucia': 2010    NaN
 2012    6.7
 Name: Andalucia, dtype: float64}

In [244]:
pd.DataFrame(mydata)

        comm  year  pop
0     Madrid  2010  6.3
1     Madrid  2012  6.5
2     Madrid  2015  7.9
3  Andalucia  2012  6.7
4  Andalucia  2015  7.5
5  Andalucia  2018  8.9

#### __Posibles entradas de datos para el constructor DataFrame__

Si el índice y las columnas de un DataFrame tienen definidos atributos de nombre, éstos
también se mostrarán:

In [245]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [246]:
frame3.index.name = "year"
frame3.columns.name = "state"
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

------

__Ejemplo propio__

In [247]:
myframe3

      Madrid  Andalucia
2010     6.5        NaN
2012     6.5        6.7
2015     7.9        7.5

In [248]:
myframe3.index.name = "year"
myframe3.columns.name = "comm"
myframe3

comm  Madrid  Andalucia
year
2010     6.5        NaN
2012     6.5        6.7
2015     7.9        7.5

A diferencia de `Series` , DataFrame no tiene atributo name. El método `to_numpy` de
DataFrame devuelve los datos contenidos en el DataFrame como un `ndarray`
bidimensional

In [249]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

----------

__Ejemplo propio__

In [250]:
myframe3.to_numpy()

array([[6.5, nan],
       [6.5, 6.7],
       [7.9, 7.5]])

Si las columnas del DataFrame son de diferentes tipos de datos, el tipo de datos del array devuelto se elegirá para acomodar todas las columnas, veamos lo que contiene frame2:

In [251]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [252]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, -1.2],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, -1.5],
       [2003, 'Nevada', 3.2, -1.7]], dtype=object)

----------

__Ejemplo propio__

In [253]:
myframe2

   year       comm  pop  debt
0  2010     Madrid  6.3   NaN
1  2012     Madrid  6.5   NaN
2  2015     Madrid  7.9  -2.4
3  2012  Andalucia  6.7   NaN
4  2015  Andalucia  7.5   3.7
5  2018  Andalucia  8.9  -6.3

In [254]:
myframe2.to_numpy()

array([[2010, 'Madrid', 6.3, nan],
       [2012, 'Madrid', 6.5, nan],
       [2015, 'Madrid', 7.9, -2.4],
       [2012, 'Andalucia', 6.7, nan],
       [2015, 'Andalucia', 7.5, 3.7],
       [2018, 'Andalucia', 8.9, -6.3]], dtype=object)

#### __Objetos índice__

Los objetos `Index` de pandas son responsables de mantener las etiquetas de los ejes
(incluyendo los nombres de las columnas de un DataFrame) y otros metadatos (como elnombre o nombres de los ejes). Cualquier array u otra secuencia de etiquetas que se utilice al construir una `Series` o DataFrame se convierte internamente en un Índice:

In [255]:
import numpy as np

In [256]:
obj = pd.Series(np.arange(3), index=["a", "b", "c"])
obj

a    0
b    1
c    2
dtype: int64

In [257]:
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [258]:
index[1:]

Index(['b', 'c'], dtype='object')

--------

__Ejemplo propio__

In [259]:
myobj = pd.Series(np.arange(7), index=["alfa", "beta", "gamma", "delta", "epsilon", "omega", "zeta"])
myobj

alfa       0
beta       1
gamma      2
delta      3
epsilon    4
omega      5
zeta       6
dtype: int64

In [260]:
myindex = myobj.index
myindex

Index(['alfa', 'beta', 'gamma', 'delta', 'epsilon', 'omega', 'zeta'], dtype='object')

In [261]:
myindex[1:]

Index(['beta', 'gamma', 'delta', 'epsilon', 'omega', 'zeta'], dtype='object')

Los objetos índice son inmutables y, por tanto, no pueden ser modificados por el usuario:

In [262]:
index[1] = "d" # TypeError

TypeError: Index does not support mutable operations

-------

__Ejemplo propio__

In [ ]:
myindex[3] = "iota"

TypeError: Index does not support mutable operations

La inmutabilidad hace que sea más seguro compartir objetos índice entre estructuras de
datos:

In [ ]:
labels = pd.Index(np.arange(3))
labels

Index([0, 1, 2], dtype='int64')

In [268]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [267]:
obj2.index is labels

True

--------

__Ejemplo propio__

In [266]:
mylabels = pd.Index(np.arange(8))
mylabels

Index([0, 1, 2, 3, 4, 5, 6, 7], dtype='int64')

In [265]:
myobj2 = pd.Series(['alfa', 'beta', 'gamma', 'delta', 'epsilon', 'zeta', 'eta', 'theta'], index=mylabels)
myobj2

0       alfa
1       beta
2      gamma
3      delta
4    epsilon
5       zeta
6        eta
7      theta
dtype: object

In [264]:
myobj2.index is mylabels

True

Además de ser similar a un array, un índice también se comporta como un conjunto (set) de tamaño fijo:

In [263]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [269]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [270]:
"Ohio" in frame3.columns

True

In [271]:
2003 in frame3.index

False

------------

__Ejemplo propio__

In [272]:
myframe3

comm  Madrid  Andalucia
year
2010     6.5        NaN
2012     6.5        6.7
2015     7.9        7.5

In [273]:
myframe3.columns

Index(['Madrid', 'Andalucia'], dtype='object', name='comm')

In [274]:
"Madrid" in myframe3.columns

True

In [275]:
2022 in myframe3.index

False

A diferencia de los conjuntos ( `set()` ) de Python, un índice de pandas puede contener
etiquetas duplicadas:

In [276]:
pd.Index(["foo", "foo", "bar", "bar"])

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

-------

__Ejemplo propio__

In [277]:
pd.Index([1, 1, 1, 3, 3, 3, 3])

Index([1, 1, 1, 3, 3, 3, 3], dtype='int64')

Las selecciones con etiquetas duplicadas tomarán todas las apariciones de esa etiqueta.
Cada Índice tiene una serie de métodos y propiedades para la lógica de conjuntos, que
responden a otras preguntas habituales sobre los datos que contiene. Algunas de las más
útiles se resumen en:

![img_tabla_2](../img/tabla_2.png)

### __FUNCIONES ESENCIALES__

Esta sección es una guia a través de la mecánica fundamental de la interacción con los datos contenidos en una Serie o DataFrame.

- #### __1 - Reindexación (Reindexing)__

Un método importante en los objetos pandas es `reindex` , que significa crear un nuevo
objeto con los valores reordenados para alinearlos con el nuevo índice. Consideremos un
ejemplo:

In [278]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

-------------

__Ejemplo propio__

In [279]:
myobj = pd.Series(['a', 'b', 'c', 'd'], index=[4, 2, 1, 3])
myobj

4    a
2    b
1    c
3    d
dtype: object

Si se llama a `reindex` en esta `Series` , los datos se reordenan de acuerdo con el nuevo índice, introduciendo los valores que faltan si alguno de los valores del índice no estaba ya presente:

In [280]:
obj2 = obj.reindex(["a", "b", "c", "d", "e"])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

--------

__Ejemplo propio__

In [281]:
myobj2 = myobj.reindex([1,2,3,4])
myobj2

1    c
2    b
3    d
4    a
dtype: object

En el caso de datos ordenados como series temporales, es posible que desee realizar alguna interpolación o relleno de valores al reindexar. Utilizando un método como `ffill` , que rellena los valores hacia delante:

In [282]:
obj3 = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [283]:
obj3.reindex(np.arange(6), method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

--------

__Ejemplo propio__

In [284]:
myobj3 = pd.Series(['z', 'x', 'y', 'w', 'v'], index=[1, 4, 7, 10, 15])
myobj3

1     z
4     x
7     y
10    w
15    v
dtype: object

In [285]:
myobj3.reindex(np.arange(15), method="ffill")

0     NaN
1       z
2       z
3       z
4       x
5       x
6       x
7       y
8       y
9       y
10      w
11      w
12      w
13      w
14      w
dtype: object

Con DataFrame, `reindex` puede alterar el índice (de filas), las columnas o ambos. Si sólo se le pasa una secuencia, reindexa las filas del resultado:

In [286]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                        index=["a", "c", "d"],
                        columns=["Ohio", "Texas", "California"])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [287]:
frame2 = frame.reindex(index=["a", "b", "c", "d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [288]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [289]:
states = ["Texas", "Utah", "California"]
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

------

__Ejemplo propio__

In [290]:
myframe = pd.DataFrame(np.arange(12).reshape((4, 3)),
                        index=[2, 1, 4, 3],
                        columns=["Andalucia", "Catalunya", "Cantabria"])
myframe

   Andalucia  Catalunya  Cantabria
2          0          1          2
1          3          4          5
4          6          7          8
3          9         10         11

In [291]:
myframe2 = myframe.reindex(index=[0, 1, 2, 3, 4])
myframe2

   Andalucia  Catalunya  Cantabria
0        NaN        NaN        NaN
1        3.0        4.0        5.0
2        0.0        1.0        2.0
3        9.0       10.0       11.0
4        6.0        7.0        8.0

In [292]:
myframe

   Andalucia  Catalunya  Cantabria
2          0          1          2
1          3          4          5
4          6          7          8
3          9         10         11

In [293]:
mycomms = ["Andalucia", "Canarias", "Cantabria"]
myframe.reindex(columns=mycomms)

   Andalucia  Canarias  Cantabria
2          0       NaN          2
1          3       NaN          5
4          6       NaN          8
3          9       NaN         11

Como `"Ohio"` no estaba en los `states` , los datos de esa columna se eliminan del
resultado. Otra forma de hacer `reindex` en un eje concreto es pasar las nuevas etiquetasde eje como argumento posicional y, a continuación, especificar el eje que se va a reindexar con la palabra clave `axis`:

In [294]:
frame.reindex(states, axis="columns")

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

-------

__Ejemplo propio__

In [295]:
myframe.reindex(mycomms, axis="columns")

   Andalucia  Canarias  Cantabria
2          0       NaN          2
1          3       NaN          5
4          6       NaN          8
3          9       NaN         11

Consulte la siguiente tabla para obtener más información sobre los argumentos para
reindexar:

![img_tabla_2](../img/tabla_3.png)

En un DataFrame tambien se puede usar `loc` e `iloc` , para reindexar, y muchos usuarios
prefieren hacerlo siempre de esta manera. Esto sólo funciona si todas las nuevas etiquetas de índice ya existen en el DataFrame (mientras que reindex insertará los datos que falten para las nuevas etiquetas):

In [296]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [297]:
frame.loc[["a", "d", "c"], ["California", "Texas"]]

   California  Texas
a           2      1
d           8      7
c           5      4

---------

__Ejemplo propio__

In [298]:
myframe

   Andalucia  Catalunya  Cantabria
2          0          1          2
1          3          4          5
4          6          7          8
3          9         10         11

In [299]:
myframe.loc[[3,4,1,2], ["Cantabria", "Andalucia"]]

   Cantabria  Andalucia
3         11          9
4          8          6
1          5          3
2          2          0

- #### __2 - Eliminar entradas de un eje__

Eliminar una o más entradas de un eje es sencillo si ya tienes un array o una lista de índices sin esas entradas, ya que puedes utilizar el método `reindex` o la indexación basada en `.loc` . Como eso puede requerir un poco de lógica el método `drop` devolverá un nuevo objeto con el valor o valores indicados eliminados de un eje:

In [300]:
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [301]:
#alvknasñdlvkas´dovl

In [302]:
new_obj = obj.drop("c")
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [303]:
obj.drop(["d", "c"])

a    0.0
b    1.0
e    4.0
dtype: float64

--------

__Ejemplo propio__

In [304]:
myobj = pd.Series(np.arange(7.), index=[1,2,3,4,5,6,7])
myobj

1    0.0
2    1.0
3    2.0
4    3.0
5    4.0
6    5.0
7    6.0
dtype: float64

In [305]:
mynew_obj = myobj.drop(5)
mynew_obj

1    0.0
2    1.0
3    2.0
4    3.0
6    5.0
7    6.0
dtype: float64

In [306]:
myobj.drop([2,6])

1    0.0
3    2.0
4    3.0
5    4.0
7    6.0
dtype: float64

Con DataFrame, los valores índice se pueden eliminar de cualquiera de los ejes. Para ilustrar esto, primero crearemos un DataFrame de ejemplo:

In [307]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
index=["Ohio", "Colorado", "Utah", "New York"],
columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

-------

__Ejemplo propio__

In [369]:
mydata = pd.DataFrame(np.arange(16).reshape((4, 4)),
index=["Twiter", "Instagram", "TicToc", "Netflix"],
columns=["Envidia", "Ira", "Gula", "Pereza"])
mydata

           Envidia  Ira  Gula  Pereza
Twiter           0    1     2       3
Instagram        4    5     6       7
TicToc           8    9    10      11
Netflix         12   13    14      15

Si se llama a `drop` con una secuencia de etiquetas, se eliminarán los valores de las
etiquetas de fila (eje 0):

In [309]:
data.drop(index=["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

----------

__Ejemplo propio__

In [310]:
mydata.drop(index=["Instagram", "Netflix"])

        Envidia  Ira  Gula  Pereza
Twiter        0    1     2       3
TicToc        8    9    10      11

Para eliminar las etiquetas de las columnas, utilice en su lugar la palabra clave `columns` :

In [311]:
data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

-------

__Ejemplo propio__

In [312]:
mydata.drop(columns=["Gula"])

           Envidia  Ira  Pereza
Twiter           0    1       3
Instagram        4    5       7
TicToc           8    9      11
Netflix         12   13      15

También puede eliminar valores de las columnas pasando `axis=1` ( como en NumPy) o
`axis="columns"` :

In [313]:
data.drop("two", axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [314]:
data.drop(["two", "four"], axis="columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

-------

__Ejemplo propio__

In [315]:
mydata.drop("Ira", axis=1)

           Envidia  Gula  Pereza
Twiter           0     2       3
Instagram        4     6       7
TicToc           8    10      11
Netflix         12    14      15

In [316]:
mydata.drop(["Envidia", "Pereza"], axis="columns")

           Ira  Gula
Twiter       1     2
Instagram    5     6
TicToc       9    10
Netflix     13    14

- #### __3 - Indexación, selección y filtrado__

La indexación de series ( `obj[...]` ) funciona de forma análoga a la indexación de arrays de NumPy, con la diferencia de que puedes utilizar los valores índice de la serie en lugar de sólo enteros. He aquí algunos ejemplos:

In [317]:
obj = pd.Series(np.arange(4.), index=["a", "b", "c", "d"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [318]:
obj["b"]

1.0

In [319]:
obj[1]

/tmp/ipykernel_7968/2469632899.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[1]

1.0

In [320]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [321]:
obj[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [322]:
obj[[1, 3]]

/tmp/ipykernel_7968/2982346117.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [323]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

-----------------

__Ejemplo propio__

In [324]:
myobj = pd.Series(np.arange(7.), index=['alfa', 'beta', 'gamma', 'delta', 'epsilon', 'theta', 'iota'])
myobj

alfa       0.0
beta       1.0
gamma      2.0
delta      3.0
epsilon    4.0
theta      5.0
iota       6.0
dtype: float64

In [325]:
myobj["delta"]

3.0

In [327]:
myobj[6]

/tmp/ipykernel_7968/1240962274.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  myobj[6]

6.0

In [326]:
myobj[3:5]

delta      3.0
epsilon    4.0
dtype: float64

In [328]:
myobj[["beta", "alfa", "delta"]]

beta     1.0
alfa     0.0
delta    3.0
dtype: float64

In [329]:
myobj[[1, 3]]

/tmp/ipykernel_7968/3371988583.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  myobj[[1, 3]]

beta     1.0
delta    3.0
dtype: float64

In [330]:
myobj[myobj < 2]

alfa    0.0
beta    1.0
dtype: float64

Aunque puede seleccionar datos por etiqueta de esta manera, la forma preferida de
seleccionar valores de índice es con el operador especial `loc` :

In [331]:
obj.loc[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

----------

__Ejemplo propio__

In [332]:
myobj.loc[['beta','alfa','delta']]

beta     1.0
alfa     0.0
delta    3.0
dtype: float64

La razón para preferir `loc` es el tratamiento diferente de los enteros cuando se indexa con `[]` . La indexación normal basada en `[]` tratará los enteros como etiquetas si el índice contiene enteros, por lo que el comportamiento difiere dependiendo del tipo de datos del índice. Por ejemplo:

In [333]:
obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])
obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])

In [334]:
obj1

2    1
0    2
1    3
dtype: int64

In [335]:
obj2

a    1
b    2
c    3
dtype: int64

In [336]:
obj1[[0, 1, 2]]

0    2
1    3
2    1
dtype: int64

In [337]:
obj2[[0, 1, 2]]

/tmp/ipykernel_7968/2599987575.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj2[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

------------

__Ejemplo propio__

In [338]:
myobj1 = pd.Series([100, 50, 20, 15, 10, 8, 6, 3, 0], index=[2, 0, 1, 7, 3, 5, 4, 9, 8])
myobj2 = pd.Series([1, 0, 2, 3, 5], index=["b", "d", "e", "a", "c"])

In [339]:
myobj1

2    100
0     50
1     20
7     15
3     10
5      8
4      6
9      3
8      0
dtype: int64

In [340]:
myobj2

b    1
d    0
e    2
a    3
c    5
dtype: int64

In [341]:
myobj1[[2, 5, 4]]

2    100
5      8
4      6
dtype: int64

In [342]:
myobj2[[0, 1, 2]]

/tmp/ipykernel_7968/2625583189.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  myobj2[[0, 1, 2]]

b    1
d    0
e    2
dtype: int64

Al utilizar `loc` , la expresión `obj.loc[[0, 1, 2]]` fallará cuando el índice no contenga
enteros:

In [343]:
obj2.loc[[0, 1]]

KeyError: "None of [Index([0, 1], dtype='int64')] are in the [index]"

-------

__Ejemplo propio__

In [344]:
myobj2.loc[[0, 3]]

KeyError: "None of [Index([0, 3], dtype='int64')] are in the [index]"

Dado que el operador `loc` indexa exclusivamente con etiquetas, existe también un
operador `iloc` que indexa exclusivamente con enteros para trabajar de forma consistente
tanto si el índice contiene enteros como si no:

In [345]:
obj1.iloc[[0, 1, 2]]

2    1
0    2
1    3
dtype: int64

In [ ]:
obj2.iloc[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

-------

__Ejemplo propio__

In [ ]:
myobj1.iloc[[2, 1, 4]]

1    20
0    50
3    10
dtype: int64

In [ ]:
myobj2.iloc[[0, 1, 4]]

b    1
d    0
c    5
dtype: int64

Precaución: También se puede rebanar (slice) con etiquetas, pero funciona de forma
diferente al rebanado(slicing) normal de Python, ya que el punto final es inclusivo:

In [ ]:
obj2.loc["b":"c"]

b    2
c    3
dtype: int64

-------

__Ejemplo propio__

In [ ]:
myobj2.loc["d":"c"]

d    0
e    2
a    3
c    5
dtype: int64

La asignación de valores mediante estos métodos modifica la sección correspondiente de la `Series` :

In [ ]:
obj2

a    1
b    2
c    3
dtype: int64

In [ ]:
obj2.loc["b":"c"] = 5
obj2

a    1
b    5
c    5
dtype: int64

--------------

__Ejemplo propio__

In [ ]:
myobj2

b    1
d    0
e    2
a    3
c    5
dtype: int64

In [ ]:
myobj2.loc["e":"c"] = 5
myobj2

b    1
d    0
e    5
a    5
c    5
dtype: int64

La indexación en un DataFrame recupera una o más columnas, ya sea con un único valor o
con una secuencia:

In [346]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
index=["Ohio", "Colorado", "Utah", "New York"],
columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [347]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [348]:
data[["three", "one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

------

__Ejemplo propio__

In [349]:
mydata = pd.DataFrame(np.arange(16).reshape((4, 4)),
index=["Twitter", "Instagram", "Netflix", "Pinterest"],
columns=["Ira", "Gula", "Envidia", "Pereza"])
mydata

           Ira  Gula  Envidia  Pereza
Twitter      0     1        2       3
Instagram    4     5        6       7
Netflix      8     9       10      11
Pinterest   12    13       14      15

In [350]:
mydata["Gula"]

Twitter       1
Instagram     5
Netflix       9
Pinterest    13
Name: Gula, dtype: int64

In [351]:
mydata[["Envidia", "Ira"]]

           Envidia  Ira
Twitter          2    0
Instagram        6    4
Netflix         10    8
Pinterest       14   12

Este tipo de indexación tiene algunos casos especiales. El primero es el corte (slicing) o la selección de datos con una array booleano:

In [ ]:
data[:2]
# selecciona las primeras dos filas del DataFrame.

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [ ]:
booleano_a = data.to_numpy()
booleano_a

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [ ]:
data[data["three"] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

--------

__Ejemplo propio__

In [ ]:
mydata[:2]
# selecciona las primeras dos filas del DataFrame.

           Ira  Gula  Envidia  Pereza
Twitter      0     1        2       3
Instagram    4     5        6       7

In [ ]:
booleano_a = mydata.to_numpy()
booleano_a

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [ ]:
mydata[mydata["Envidia"] > 9]

           Ira  Gula  Envidia  Pereza
Netflix      8     9       10      11
Pinterest   12    13       14      15

La sintaxis de selección de filas `data[:2]` se proporciona por comodidad. Si se pasa un
único elemento o una lista al operador `[]` selecciona columnas.

Otro caso de uso es la indexación con un DataFrame booleano, como el producido por una
comparación escalar. Considere un DataFrame con todos los valores booleanos producidos
por comparación con un valor escalar:

In [ ]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

----------

__Ejemplo propio__

In [ ]:
mydata < 5

             Ira   Gula  Envidia  Pereza
Twitter     True   True     True    True
Instagram   True  False    False   False
Netflix    False  False    False   False
Pinterest  False  False    False   False

Podemos utilizar este DataFrame para asignar el valor 0 a cada ubicación con el valor `True` , así:

In [352]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

------------

__Ejemplo propio__

In [353]:
mydata[mydata < 5] = 0
mydata

           Ira  Gula  Envidia  Pereza
Twitter      0     0        0       0
Instagram    0     5        6       7
Netflix      8     9       10      11
Pinterest   12    13       14      15

#### __Selección en un DataFrame con loc e iloc__

Al igual que `Series` , los `DataFrame` tiene atributos especiales `loc` e `iloc` para la indexación basada en etiquetas y en enteros, respectivamente. Como un `DataFrame` es
bidimensional, puede seleccionar un subconjunto de filas y columnas con notación tipo
NumPy utilizando etiquetas de eje (loc) o enteros (iloc).

Como primer ejemplo, vamos a seleccionar una sola fila por etiqueta:

In [354]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [355]:
data.loc["Colorado"]

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int64

------------

__Ejemplo propio__

In [356]:
mydata

           Ira  Gula  Envidia  Pereza
Twitter      0     0        0       0
Instagram    0     5        6       7
Netflix      8     9       10      11
Pinterest   12    13       14      15

In [ ]:
mydata.loc["Netflix"]

Ira         8
Gula        9
Envidia    10
Pereza     11
Name: Netflix, dtype: int64

El resultado de seleccionar una sola fila es una `Series` con un índice que contiene las
etiquetas de las columnas del `DataFrame` . Para seleccionar múltiples valores, creando un nuevo DataFrame, se le pasa una secuencia de etiquetas:

In [ ]:
data.loc[["Colorado", "New York"]]

          one  two  three  four
Colorado    0    5      6     7
New York   12   13     14    15

--------

__Ejemplo propio__

In [ ]:
mydata.loc[["Netflix", "Twitter"]]

         Ira  Gula  Envidia  Pereza
Netflix    8     9       10      11
Twitter    0     0        0       0

Puede combinar la selección de filas y columnas en `loc` separando las selecciones con una
coma:

In [ ]:
data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int64

------------

__Ejemplo propio__

In [ ]:
mydata.loc["Instagram", ["Gula", "Ira"]]

Gula    5
Ira     0
Name: Instagram, dtype: int64

A continuación, realizaremos algunas selecciones similares con enteros utilizando `iloc` :

In [ ]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [ ]:
data.iloc[[2, 1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    0    5      6     7

In [ ]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [ ]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

----------

__Ejemplo propio__

In [ ]:
mydata.iloc[2]

Ira         8
Gula        9
Envidia    10
Pereza     11
Name: Netflix, dtype: int64

In [ ]:
mydata.iloc[[2, 1]]

           Ira  Gula  Envidia  Pereza
Netflix      8     9       10      11
Instagram    0     5        6       7

In [ ]:
mydata.iloc[2, [3, 0, 1]]

Pereza    11
Ira        8
Gula       9
Name: Netflix, dtype: int64

In [ ]:
mydata.iloc[[1, 2], [3, 0, 1]]

           Pereza  Ira  Gula
Instagram       7    0     5
Netflix        11    8     9

Ambas funciones de indexación funcionan con trozos (slices) además de con etiquetas
individuales o listas de etiquetas:

In [ ]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
data.loc[:"Utah", "two"]
# Devuelve los valores de la columna "two"
# para todas las filas desde el inicio
# hasta la fila con la etiqueta "Utah"

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [ ]:
data.iloc[:, :3][data.three > 5]
# Muestra las filas que cumplen
# la condición data.three > 5
# para las columnas 'one', 'two'
# y 'three'
# Para mayor claridad ejecute
# data.iloc[:, :3] y luego
# data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

------

__Ejemplo propio__

In [ ]:
mydata

           Ira  Gula  Envidia  Pereza
Twitter      0     0        0       0
Instagram    0     5        6       7
Netflix      8     9       10      11
Pinterest   12    13       14      15

In [ ]:
mydata.loc[:"Netflix", "Envidia"]
# Devuelve los valores de la columna "Envidia"
# para todas las filas desde el inicio
# hasta la fila con la etiqueta "Netflix"

Twitter       0
Instagram     6
Netflix      10
Name: Envidia, dtype: int64

In [ ]:
mydata.iloc[:, :3][mydata.Envidia > 5]
# Muestra las filas que cumplen
# la condición mydata.three > 5
# para las columnas 'Ira', 'Gula'
# y 'Envidia'
# Para mayor claridad ejecute
# mydata.iloc[:, :3] y luego
# mydata.iloc[:, :3][mydata.Envidia > 5]

           Ira  Gula  Envidia
Instagram    0     5        6
Netflix      8     9       10
Pinterest   12    13       14

Los arrays Booleanos pueden ser usados con `loc` pero no `iloc` :

Considere lo siguiente:

In [ ]:
data.three >= 2

Ohio        False
Colorado     True
Utah         True
New York     True
Name: three, dtype: bool

In [ ]:
data.loc[data.three >= 2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

-------

__Ejemplo propio__

In [ ]:
mydata.Gula >= 2

Twitter      False
Instagram     True
Netflix       True
Pinterest     True
Name: Gula, dtype: bool

In [ ]:
mydata.loc[mydata.Gula >= 2]

           Ira  Gula  Envidia  Pereza
Instagram    0     5        6       7
Netflix      8     9       10      11
Pinterest   12    13       14      15

Hay muchas formas de seleccionar y reordenar los datos contenidos en un objeto pandas.
Para un `DataFrame` , la siguiente tabla proporciona un breve resumen de muchas de ellas.

Como se verá más adelante, hay una serie de opciones adicionales para trabajar con índices jerárquicos.

![img_tabla_4](../img/tabla_4.png)

#### __Errores en la indexación de números enteros__

Trabajar con objetos pandas indexados por enteros puede ser un escollo para los nuevos
usuarios ya que funcionan de forma diferente a las estructuras de datos incorporadas en
Python como listas y tuplas. Por ejemplo, es posible que no espere que el siguiente código genere un error:

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
ser = pd.Series(np.arange(3.))

In [ ]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [ ]:
ser[-1]

KeyError: -1

-----------

__Ejemplo propio__

In [ ]:
myser = pd.Series(np.arange(10))

In [ ]:
myser

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [ ]:
myser[-1]

KeyError: -1

En este caso, pandas podría "recurrir" a la indexación por enteros, pero es difícil hacer esto en general sin introducir errores sutiles en el código de usuario. Aquí tenemos un índice quecontiene 0, 1 y 2, pero pandas no quiere adivinar lo que quiere el usuario (indexación basada en etiquetas o basada en posiciones):

In [ ]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

En cambio, con un índice no entero, no existe tal ambigüedad:

In [ ]:
ser2 = pd.Series(np.arange(3.), index=["a", "b", "c"])
ser2[-1]

/tmp/ipykernel_7968/821879068.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser2[-1]

2.0

-----------

__Ejemplo propio__

In [ ]:
myser2 = pd.Series(np.arange(9), index=["alfa", "beta", "gamma", "delta", "zeta", "eta", "epsilon", "iota", "kappa"])
myser2[-1]

/tmp/ipykernel_7968/569869935.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  myser2[-1]

8

Si tienes un índice de eje que contiene enteros, la selección de datos siempre estará
orientada a etiquetas. Como se ha dicho anteriormente, si se utiliza `loc` (para etiquetas) o `iloc` (para enteros) se obtendrá exactamente lo que se desea:

In [ ]:
ser.iloc[-1]

2.0

---------

__Ejemplo propio__

In [ ]:
myser.iloc[-1]

9

Por otra parte, el corte (slicing) con números enteros siempre está orientado a números
enteros:

In [ ]:
ser[:2]

0    0.0
1    1.0
dtype: float64

-------

__Ejemplo propio__

In [ ]:
myser[:4]

0    0
1    1
2    2
3    3
dtype: int64

Como consecuencia de estos errores, es mejor preferir siempre la indexación con `loc` e
`iloc` para evitar ambigüedades.

#### __Errores de la indexación encadenada__

En la sección anterior vimos cómo se pueden hacer selecciones flexibles en un DataFrame
utilizando `loc` e `iloc` . Estos atributos de indexación también se pueden utilizar para modificar objetos DataFrame "in situ", pero hacerlo requiere cierto cuidado.
Por ejemplo, en el ejemplo DataFrame anterior, podemos asignar a una columna o fila por
etiqueta o posición entera:

In [357]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [358]:
data.loc[:, "one"] = 1
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [359]:
data.iloc[2] = 5
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        5    5      5     5
New York    1   13     14    15

In [360]:
data.loc[data["four"] > 5] = 3
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

---------

__Ejemplo propio__

In [370]:
mydata

           Envidia  Ira  Gula  Pereza
Twiter           0    1     2       3
Instagram        4    5     6       7
TicToc           8    9    10      11
Netflix         12   13    14      15

In [371]:
mydata.loc[:, "Ira"] = 1
mydata

           Envidia  Ira  Gula  Pereza
Twiter           0    1     2       3
Instagram        4    1     6       7
TicToc           8    1    10      11
Netflix         12    1    14      15

In [372]:
mydata.iloc[3] = 100
mydata

           Envidia  Ira  Gula  Pereza
Twiter           0    1     2       3
Instagram        4    1     6       7
TicToc           8    1    10      11
Netflix        100  100   100     100

In [373]:
mydata.loc[mydata["Pereza"] > 5] = 3
mydata

           Envidia  Ira  Gula  Pereza
Twiter           0    1     2       3
Instagram        3    3     3       3
TicToc           3    3     3       3
Netflix          3    3     3       3

Un error común para los nuevos usuarios de pandas es encadenar selecciones cuando se
asignan de esta manera:

In [374]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [375]:
data.loc[data.three == 5]
# La condición data.three == 5
# crea una Serie booleana que
# tiene True para las filas
# donde el valor en la columna "three"
# es igual a 5 y False para las demás filas.

      one  two  three  four
Utah    5    5      5     5

In [376]:
data.loc[data.three == 5]["three"] = 6

/tmp/ipykernel_7968/867481848.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data.loc[data.three == 5]["three"] = 6

-------

__Ejemplo propio__

In [377]:
mydata

           Envidia  Ira  Gula  Pereza
Twiter           0    1     2       3
Instagram        3    3     3       3
TicToc           3    3     3       3
Netflix          3    3     3       3

In [378]:
mydata.loc[mydata.Ira == 3]
# La condición mydata.Ira == 3
# crea una Serie booleana que
# tiene True para las filas
# donde el valor en la columna "Ira"
# es igual a 3 y False para las demás filas.

           Envidia  Ira  Gula  Pereza
Instagram        3    3     3       3
TicToc           3    3     3       3
Netflix          3    3     3       3

In [379]:
mydata.loc[mydata.Gula == 3]["Gula"] = 9

/tmp/ipykernel_7968/3643720785.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  mydata.loc[mydata.Gula == 3]["Gula"] = 9

Dependiendo del contenido de los datos, esto puede imprimir una advertencia especial
`SettingWithCopyWarning` , que le advierte de que está intentando modificar un valor
temporal (el resultado no vacío de `data.loc[data.three == 5]`) en lugar del
DataFrame original `data` , que podría ser lo que pretendía. En este caso, `data` no se ha modificado:

In [380]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

------

__Ejemplo propio__

In [381]:
mydata

           Envidia  Ira  Gula  Pereza
Twiter           0    1     2       3
Instagram        3    3     3       3
TicToc           3    3     3       3
Netflix          3    3     3       3

En estos casos, la solución consiste en reescribir la asignación encadenada para utilizar una única operación `loc` :

In [382]:
data.loc[data.three == 5, "three"] = 6
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      6     5
New York    3    3      3     3

---------

__Ejemplo propio__

In [383]:
mydata.loc[mydata.Gula == 2, "Gula"] = 99
mydata

           Envidia  Ira  Gula  Pereza
Twiter           0    1    99       3
Instagram        3    3     3       3
TicToc           3    3     3       3
Netflix          3    3     3       3